<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"277583124f2a09b8de633b59e09a075be068c53a782804dce75fa5e060bf61cc","plan_job_ref":"Job Create terraform plan #29 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6830124109","plan_hash":"340ca46de5a73dc7c6c2e73d24aff45e66fc4d24efd890d7fa11ee8534e5515f","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/5efd3ca7ec7e8b8fa4647f4bdd33a5e8c2704ec4140dbb0a476da95bdfb044cc.zip" -> "builds/6e64d43f63f60c6e470b54443a4c975cccf9152c77e07face044716f77531832.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-11-09T00:23:15.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:17" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:17/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "17" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "17" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/6e64d43f63f60c6e470b54443a4c975cccf9152c77e07face044716f77531832.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/6e64d43f63f60c6e470b54443a4c975cccf9152c77e07face044716f77531832.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/5efd3ca7ec7e8b8fa4647f4bdd33a5e8c2704ec4140dbb0a476da95bdfb044cc.zip" -> "builds/6e64d43f63f60c6e470b54443a4c975cccf9152c77e07face044716f77531832.zip"
          ~ "timestamp" = "1699489382067377000" -> "1699654626089082000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #29](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6830124109)